U=[2 4 -7 3 1; 6 3 -4 7 2; 2 3 -4 5 7; 0 8 -14 4 7; -6 5 -10 -3 5];
V=[8 -2 6 8 2; -4 -2 6 2 17; 28 -4 12 22 -11; 16 -1 3 10 -14; 0 6 -8 8 19];
disp('3.1')
disp('Базис U')
[R,K]=rref(U);
u=U(:,K)
disp('Розмірность підпростору U')
n_U=length(K)
disp('3.2')
disp('Базис V')
[R,K]=rref(V);
v=V(:,K)
disp('Розмірность підпростору V')
n_V=length(K)
disp('3.3')
disp('Базис U+V')
UV=[U;V];
[R,K]=rref(UV);
uv=UV(:,K)
disp('Розмірность підпростору U+V')
n_UV=rank(UV)
disp('3.4')
disp('Базис U|`|V')
U_V=[U;-V];
r=rref(U_V);
x4=1;
x5=0;
x1=-r(1,4)*x4-r(1,5)*x5;
x2=-r(2,4)*x4-r(2,5)*x5;
x3=-r(3,4)*x4-r(3,5)*x5;
f1=[x1 x2 x3 x4 x5];
x4=0;
x5=1;
x1=-r(1,4)*x4-r(1,5)*x5;
x2=-r(2,4)*x4-r(2,5)*x5;
x3=-r(3,4)*x4-r(3,5)*x5;
f2=[x1 x2 x3 x4 x5];
F=[f1; f2];
for i=1:3  
  for j=1:3
    F(i,j)=V(i,j)*U(i,j);
  end
end
F
disp('Розмірность підпростору U|`|V')
n=n_U+n_V-n_UV